
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 1 to change, 3 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.POSTGRES_HOST
* Replace
  * module.lau-case-db-flexible.azurerm_postgresql_flexible_server.pgsql_server
  * module.lau-case-db-flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;azure.extensions&#34;]
  * module.lau-case-db-flexible.azurerm_postgresql_flexible_server_database.pg_databases[&#34;lau_case&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES_HOST will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES_HOST" {
        id                      = "https://lau-aat.vault.azure.net/secrets/case-backend-POSTGRES-HOST/c775a00ac9cc49968e00b21c01f55292"
        name                    = "case-backend-POSTGRES-HOST"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.lau-case-db-flexible.azurerm_postgresql_flexible_server.pgsql_server must be replaced
-/+ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      ~ delegated_subnet_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/postgresql" -> "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/postgres-expanded" # forces replacement
      ~ fqdn                          = "lau-case-backend-flexible-aat.postgres.database.azure.com" -> (known after apply)
      ~ id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/lau-case-backend-flexible-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/lau-case-backend-flexible-aat" -> (known after apply)
        name                          = "lau-case-backend-flexible-aat"
      ~ public_network_access_enabled = false -> (known after apply)
        tags                          = {
            "application"         = "log-and-audit"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/lau-case-backend.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#lau-dev"
            "environment"         = "staging"
            "managedBy"           = "LAU"
        }
      - zone                          = "1" -> null
        # (12 unchanged attributes hidden)

      + high_availability {
          + mode = "ZoneRedundant"
        }

        # (2 unchanged blocks hidden)
    }

  # module.lau-case-db-flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["azure.extensions"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      ~ id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/lau-case-backend-flexible-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/lau-case-backend-flexible-aat/configurations/azure.extensions" -> (known after apply)
        name      = "azure.extensions"
      ~ server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/lau-case-backend-flexible-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/lau-case-backend-flexible-aat" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.lau-case-db-flexible.azurerm_postgresql_flexible_server_database.pg_databases["lau_case"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      ~ charset   = "UTF8" -> "utf8"
      ~ id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/lau-case-backend-flexible-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/lau-case-backend-flexible-aat/databases/lau_case" -> (known after apply)
        name      = "lau_case"
      ~ server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/lau-case-backend-flexible-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/lau-case-backend-flexible-aat" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":519,"Program":"tfcmt","SHA1":"","Vars":{}} -->